// data.js
const dbData = {
    "全国": {
      p: {
        "民间文学": 251,
        "传统音乐": 431,
        "传统舞蹈": 356,
        "传统戏剧": 473,
        "曲艺": 213,
        "传统体育、游艺与杂技": 166,
        "传统美术": 417,
        "传统技艺": 629,
        "传统医药": 182,
        "民俗": 492
      },
      r: {
        "民间文学": 123,
        "传统音乐": 380,
        "传统舞蹈": 298,
        "传统戏剧": 782,
        "曲艺": 207,
        "传统体育、游艺与杂技": 87,
        "传统美术": 377,
        "传统技艺": 513,
        "传统医药": 130,
        "民俗": 160
      }
    },
    "浙江省": {
      p: {
        "民间文学": 24,
        "传统音乐": 15,
        "传统舞蹈": 18,
        "传统戏剧": 25,
        "曲艺": 28,
        "传统体育、游艺与杂技": 12,
        "传统美术": 30,
        "传统技艺": 54,
        "传统医药": 12,
        "民俗": 39
      },
      r: {
        "民间文学": 6,
        "传统音乐": 10,
        "传统舞蹈": 12,
        "传统戏剧":44,
        "曲艺": 22,
        "传统体育、游艺与杂技": 7,
        "传统美术": 35,
        "传统技艺": 39,
        "传统医药": 7,
        "民俗": 14
      }
    },
    "黑龙江省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "吉林省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "辽宁省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "天津市": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "北京市": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "河北省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "山东省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "山西省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "内蒙古自治区": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "宁夏回族自治区": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "青海省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "新疆维吾尔自治区": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "西藏自治区": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "四川省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "云南省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "贵州省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "重庆市": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "甘肃省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "陕西省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "河南省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "安徽省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "江苏省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "上海市": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "福建省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "江西省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "湖南省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "广东省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "广西壮族自治区": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "香港": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "澳门": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "海南省": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "新疆生产建设兵团": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
    "中直单位": {
      p: {
        "民间文学": 1,
        "传统音乐": 7,
        "传统舞蹈": 1,
        "传统戏剧": 3,
        "曲艺": 7,
        "传统体育、游艺与杂技": 1,
        "传统美术": 6,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 8
      },
      r: {
       "民间文学": 0,
        "传统音乐": 4,
        "传统舞蹈": 0,
        "传统戏剧": 2,
        "曲艺": 11,
        "传统体育、游艺与杂技": 0,
        "传统美术": 4,
        "传统技艺": 6,
        "传统医药": 2,
        "民俗": 1
      }
    },
  };
  
